{
  "articles": [
    {
      "model": "article.article",
      "pk": 9,
      "fields": {
        "title": "Homeless Veteran to Employed Web Developer",
        "slug": "homeless_veteran_to_employed_web_developer",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-IMG_20180920_140104.jpg",
        "body": "\r\n\r\n\r\n\r\n9 months. That's 36 weeks, or 270 days. That's a long time to be homeless. After my apartment caught on fire I was really left with nothing, but I didn’t let myself stay there. The one good thing about hitting rock bottom is there’s only one way left to go, up. When I saw that  accepted the G.I. Bill®, I made the decision to move across the country from my home state of Kansas to Portland, OR to break into a new career path in technology. With very little financial cushioning and a lot of reluctance from my family and friends, I took the leap.\r\n\r\n(GI Bill® is a registered trademark of the U.S. Department of Veterans Affairs (VA). More information about education benefits offered by VA is available at the official U.S. government Web site at \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nI served as a Logistic Specialist in the US Navy, 2nd class. I was deployed to Afghanistan in 2010, and when I got back to Kansas in 2011 I worked odd jobs here and there, struggling to figure out what I wanted to do. I decided to teach myself to code. The work was interesting and there's a growing market for web developers, and I wanted in on that.\r\n\r\nI spent a lot of time self-teaching, but just couldn’t seem to land a job. Teaching yourself to code to an employer is like a big question mark. What does this guy really know and how well does he know it? I didn't have enough credentials or experience for an employer to even take a chance on me.\r\n\r\nAbout 5 days before Christmas in 2017, a few homeless guys started a fire on the top of my apartment building. I don’t know if it was to keep warm or to cook food, but it got away from them and lit the building on fire. Strangely no fire alarms went off, my alarm was a handful of firemen pounding on my front door yelling for me to get out NOW. The top floor collapsed into my apartment and I basically lost everything. I was able to salvage some clothes but that was about it. My laptop was toast. Luckily I had renters insurance, which was my saving grace. After the fire I just felt lost, I couch surfed and stayed with an aunt for a while just feeling really unsure of what to do next. I found PDX Code Guild in a Google search, and saw that the program accepted the G.I. Bill®.\r\n\r\nMy decision to move from Kansas to Portland wasn’t exactly supported by my friends and family. It was a huge risk to be in the financial state I was in and to move to a place where I didn’t know a soul, but I knew I needed to get into a tech hub and that this could be a great opportunity for me.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nWhen I first got to Portland, I stayed in a hostel for 5 days while looking for housing. It was a rude awakening to realize how much more expensive this city is compared to Kansas! Working with a couple of veteran programs, I was directed to a homeless shelter. I mean, it was that or living out of my car. Moving into a shelter was incredibly humbling and it really made me question if I was doing the right thing. My friends and family back at home were really worried about me, but I just knew I couldn’t go back to Kansas. This program would give me the skills I needed to get a good job, and the credentials to back up what I’ve learned. All through the 3-month program I lived in this shelter. It wasn’t terrible, I was always at school or working my part time job in a cafe, so really I just slept there. I had to keep pushing forward.\r\n\r\n\r\n\r\n\r\n\r\nMy mom cried when I told her the news. Heck, I even cried. Everyone is really happy for me. My friend told me “You deserve this after everything you’ve been through.” It just feels really good. The work is exciting, and I’m just really grateful that I didn't give up and throw in the towel when things got hard. It taught me a lot about my own strength and about what I'm capable of. If I could give advice to anyone struggling right now, feeling a loss of direction or discouraged, just don't give up! Three months was all it took for me to completely change my life around. It's incredible how empowering it is to realize that you CAN change you're life, just pick a direction and GO! Things have a way of falling into place once you decide that you're not going to give up. Besides, rock bottom makes a great launching pad.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nI had a really hard time breaking into any sort of tech scene in Kansas. Not only did I not have much experience, but there weren’t a lot of jobs or opportunities in this field, and the opportunities that were there were much more competitive than what I could offer at the time.  is a great place for tech. There are a ton of tech companies here, start-ups and established businesses that have been around awhile. There are a ton of meet ups held pretty much every day of the week! Tech meet ups are a great way to network, work on projects, ask for help and get to know each other. Meetups are really helpful when you’re just starting out, and Portland is full of them!\r\n\r\n\r\n\r\n\r\n\r\nI tried to teach myself to code, and I learned a ton online, but I can't understate the importance of having PDX Code Guild on my resume! The curriculum they offer is laser focused on teaching not only the basics, but the in-demand skills that employers are looking for now. The teachers all come from great backgrounds in the industry which offers a lot of guidance too, especially when trying to pick a direction to go within tech, They have really established themselves as a top destination in the country for coding, and with 3-month programs it was much more attainable for me than taking 4 years to get a degree. Not to mention the huge plus for me, it's one of the few coding bootcamps that accept the G.I. Bill®!\r\n\r\n\r\n\r\n\r\n\r\nI never stopped looking for a job. I tell people, looking for a job is a full time job. I was on every job board every day, posting my information and applying. The job I finally got an offer for was posted for less than 2 hours before I applied for it. I got an email back a couple of hours later to schedule a phone call, then an in-person interview a couple days after that. I got the job offer in under 10 days from the time I applied. Once I had that offer I found a place to live within a week. It all happened really fast, it’s incredible. Now that it’s all said and done, I’m grateful for the struggles I’ve been through, because they taught me a lesson about just how much I’m truly capable of, and about being relentless in the things I want. I hope anyone reading this who is feeling stuck can draw some hope from my story, and recognize that things can change so fast, and just keep running at your dreams! Use the resources around you and get an education! There’s so much opportunity waiting for those who are persistent. \r\n\r\n\r\n\r\nIf you’re interested in a career in tech, PDX Code Guild is hosting a FREE live intro to coding class on October 16th! Learn more and register here: https://pdxcodeguild.lpages.co/pdxcodeguild/",
        "author": "Cody- US Navy Veteran",
        "created_at": "2018-09-28",
        "favorites": 53,
        "home_page": false,
        "path": "/articles/news/homeless_veteran_to_employed_web_developer",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 38,
      "fields": {
        "title": "Why Does PDX Code Guild Start With Python?",
        "slug": "why-does-pdx-code-guild-start-with-python",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-IMG_3278.JPG",
        "body": "ôWhy start with Python?ö ItÆs a question we get asked over and over again. Why not teach another programming language like Ruby or Java? The answer is simple: It comes down to providing the best education for all of our students.\r\n\r\nAt the beginning of the bootcamp, we use Python as a tool to teach the basics of programming because of its easy syntax and readability incomparable to any other language. Instead of focusing on training students in one specific language, we use Python to teach basic data types and transferable skills applicable to most languages to get them ready to enter the workforce as an entry-level developer û with the skills to easily pick up any language and excel at it. \r\n\r\nIn addition to Python, JavaScript, HTML, CSS, and Django we also teach best practices and team skills found in most tech companies. We find that by the end of the bootcamp, your classmates are more like coworkers. This is achieved by using git and GitHub with group projects, pair programming, and personal projects as well as using scrum to organize and accomplish tasks as pairs, teams, and individual students.\r\n\r\nBy the final week, with practical programming skills in some of the most popular languages, a unique capstone, and real-life industry practice, each individual student is prepared to be the best programmer they can be!",
        "author": "PDX Code Guild",
        "created_at": "2016-11-24",
        "favorites": 27,
        "home_page": false,
        "path": "/articles/news/why-does-pdx-code-guild-start-with-python",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 39,
      "fields": {
        "title": "Making a Portfolio Site for your Job Search",
        "slug": "making-a-portfolio-site-for-your-job-search",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2296.JPG",
        "body": "There is no perfect guide to making a great portfolio site because the best portfolios are ones that reflect the personality of the maker. With that in mind, here are some tips for creating a portfolio. These will help you stand out to potential employers and colleagues.\r\n\r\nKeep It Simple\r\n\r\nOne of the most common mistakes in a portfolio is too much! Too much content, too much functionality, and too much styling!\r\n\r\nA portfolio is a collection of every piece of work that you have done. A portfolio website should be a highlight reel of your best work. Once you put more than 20 or so items, no single item stands out as important. The key is not to put anything and everything you have done on your site. Make sure what you are putting on your portfolio is relevant to the position you are seeking. For example if you are looking for a job as a web developer, donÆt put an example of an excel spreadsheet that you made. It will just drown out your relevant work!\r\n\r\nWebsites are visual, make it as easy as possible for people to see your content. While it is difficult to choose between fonts and colors. You should not over do it here. At most, 4 colors to your æthemeÆ of your site, and no more than 3 font styles.\r\n\r\nDonÆt add too much functionality. If you are applying for a front-end style job, it will be tempting to show off everything that you can do. Yet, it is important that you show you can build a good user experience as well. Focus on that first. If you want to show a particular skill with a animation or programming concept. Make that a portfolio item itself. It should not take away from the usability of your website.\r\n\r\nBe Original (Or Not)\r\n\r\n   When picking a theme to your website. It can be difficult to start from scratch. Especially if you are a back-end server engineer. So if you are not that great at design, itÆs okay to emulate other styles that influence you. Whether they are companies, art styles, etc. Remember though, itÆs okay to emulate, but definitely do not copy.\r\n\r\nSeparation of Concerns\r\n\r\n   This may seem basic, but it is easy to forget. When you are building a website you always have three tools that each handle a specific part:\r\n\r\nHTML û Content\r\nCSS û Style\r\nJavascript û Function\r\n   It is important that you keep everything separate. Over time you will want to redesign your site, add more content, and change the way it feels. This will be much easier to do if you have a clear separation of concerns. Updating your content should not affect the style of your site.\r\n\r\nUpdate Your Site Often\r\n\r\n   One of the best things you can do is to continue to add content to your site while on your job search. Often you will be in an interview and asked about a certain concept or skill. If you know how to do this, but donÆt have it on your portfolio, that is a good cue to add it. Adapting your portfolio throughout the job search is a good way to stay practiced in your skills. You will have useful feedback from interviews, even if you donÆt get the job. Using that feedback to fine tune your site, is a great way to update your site in a meaningful way.\r\n\r\nUse Existing Tools\r\n\r\n   Many programmers, myself included, are guilty of this. We often try to reinvent the wheel. But, potential employers will be much more impressed if you build something novel and unique. DonÆt rewrite tools such as blog software unless you have a good reason to. Yes some of the tools out there might not be ideal. But adapting them for your use shows a higher level of skill and understanding. In any programming job you will be using someone elseÆs code base, this is great practice to learn how to extend software for your specific needs. That is of course, only if something wonÆt work right out of the box.\r\n\r\nMake Your Site Data-Driven\r\n\r\n   As mentioned earlier, HTML handles content. But, it can be beneficial to make the distinction between markup (html) and content (data). With a data driven site, you have html that generated for you from some sort of database. Using a database will allow you to update your site without even touching the HTML. For portfolio sites, using a tool like CloudStitch will save you a ton of time while editing content and updating your site. Rather than editing an html file and re-uploading it to your site, you can simply edit columns in a Google Sheets spreadsheet. While it might not seem like a big hassle to make an html edit, if you do it enough it will quickly become tedious.\r\n\r\nKeep Positive\r\n\r\nIt is stressful looking for work. The worst thing you can do is allow this stress to reflect in your portfolio. It is easy to become frustrated when applying to jobs, but do take the time to step away from it all and maintain a positive attitude. If you look at your unemployment as an opportunity to learn new skills, it reflects well in your portfolio. Employers are impressed with initiative and a can-do attitude. What do you have to lose? The worst thing that could happen is you learn some new skills!",
        "author": "PDX Code Guild",
        "created_at": "2017-01-17",
        "favorites": 15,
        "home_page": false,
        "path": "/articles/job-advice/making-a-portfolio-site-for-your-job-search",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 40,
      "fields": {
        "title": "Should I Quit My Job and Learn Programming at a Bo",
        "slug": "should-i-quit-my-job-and-learn-programming-at-a-bo",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2121.JPG",
        "body": "I see this question popping more and more.\r\n\r\nBefore you answer the question, you should be aware of decomposition. It is a \r\nskill programmers use to solve complex problems. You take a big problem and \r\nbreak it into more manageable smaller problems.\r\n\r\n\r\nSo letÆs try this on the question we are asking:\r\nôShould I quit my job for a code boot camp?ö\r\nWeÆre are in fact asking two questions:\r\n\r\nShould I quit my job?\r\nShould I do a coding bootcamp?\r\n\r\nShould I quit my job?\r\n\r\nDo you have six months of salary saved up?\r\n\r\nWell this is pretty easyà do you have at least six months of salary saved? If not,\r\nyou should reconsider. Quitting your job without an alternative source of income\r\nis a questionable move at best.\r\n\r\nIf you do, then great for you! A word of caution though: Your job search could\r\ntake up to six months. This depends on the skills you learn, how fast you learn\r\nthem, and your prior experience.\r\n\r\n\r\nShould I attend a coding bootcamp?\r\n\r\nHave you ever written code before (even just a single line)?\r\n\r\nThere are tons of online sites that can help you get the basics of programming.\r\nTry them before you commit to three months of non-stop\r\ncoding. CodeCademy and TreeHouse are great resources when first starting out.\r\n\r\nDo you like programming?\r\n\r\nSo assuming you have tried coding to a degree, do you like it? YouÆre going to be\r\ncoding for at least 6 hours a day. Are you ready for that? Try coding after a long\r\nday of work. If you find yourself having fun even after an exhausting day you will\r\nlikely be able to handle it.\r\n\r\nAm I ready for a coding bootcamp?\r\n\r\nCoding boot camps take up a lot of time. Can you devote enough time to complete\r\nthe school? At most schools youÆre coding or in class for about 8 hours a day. You\r\nwill have assignments and homework on top of that. Additionally, to get the most\r\nout of it you will want to study on top of that. DonÆt plan to do much else during\r\nyour code boot camp.\r\n\r\nWell should I?\r\n\r\nAll that aside, it comes down to discipline and motivation. If youÆre disciplined\r\nenough to be financially stable. YouÆre probably going to be fine. But, if youÆre\r\nleaving your job for more money, or because youÆre currently unhappy. DonÆt do\r\nit.\r\n\r\nAdmittedly, most of this article has been giving reasons of why you shouldnÆt. But\r\nif you enjoy learning or have always been technical and want to take your skills to\r\nthe next level. Code schools are for people like you. It is going to be one of the\r\nmost fulfilling ventures of your life and youÆre going to love it! Good Luck!",
        "author": "PDX Code Guild",
        "created_at": "2017-04-05",
        "favorites": 26,
        "home_page": false,
        "path": "/articles/job-advice/should-i-quit-my-job-and-learn-programming-at-a-bo",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 41,
      "fields": {
        "title": "Happy Thoughts for When the Journey gets Rough",
        "slug": "happy-thoughts-for-when-the-journey-gets-rough",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2111.JPG",
        "body": "I have had a really good experience at PDX Code Guild.  I have a learned a lot, met wonderful people, and opened a bunch of options for my career.  Despite that, it has been stressful at times.  Here are five great resources to help you chill if the stress gets to you.\r\n\r\nThe Oregon Zoo Facebook page posts all sorts of cute animals.\r\nhttps://www.facebook.com/oregonzoo/?fref=ts\r\n\r\nPep Talk Generator is awesome.  It serves up a new pep talk whenever you need it.\r\nhttp://www.babevibes.com/the-pep-talk-generator/\r\n\r\nKittens!  Foster Dad John live streams the kittens he is fostering.  They are fuzzy and tiny and adorable.\r\nhttp://livestream.com/FosterKittenCam/PatiencesKittens\r\n \r\nThe To Motivate You tumblr posts motivational quotes.\r\nhttp://to-motivate-you.tumblr.com/\r\n\r\nIf pretty nature is more your thing than cute animals, this photo project is fantastic.\r\nhttp://365q.ca/",
        "author": "PDX Code Guild",
        "created_at": "2016-02-16",
        "favorites": 14,
        "home_page": false,
        "path": "/articles/job-advice/happy-thoughts-for-when-the-journey-gets-rough",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 42,
      "fields": {
        "title": "What Happens after Graduation?",
        "slug": "what-happens-after-graduation",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2156.JPG",
        "body": "I talked with CTO, Chris Jones, about the experience of students after their bootcamp experience.  Code Guild is in the process of compiling official data on student outcomes. In the meantime, Chris has mentored and tutored every class since the first class with which he graduated.\r\n\r\n \r\n\r\nIn ChrisÆs experience, people who are dedicated to finding a job typically find a job.  A month gap in between graduation and getting hired is typical.  He recommends coding daily and alums dedicating themselves to finding a job as if it was their job.   \r\n\r\n \r\n\r\nCode Guild supports students in their transition by providing continuous education support.  \r\n\r\nStudents are encouraged to continue spending time at Code Guild for the continued accountability and support.  Most of the main building is dedicated to offering a comfortable space for students to continue their learning.  \r\nCode Guild recently hired a teacher whose entire focus will be continuous education.  Alums can continue to get their code related questions answered.  \r\nSheri, the head of Code Guild,  has also offered to do a review of alumsÆ cover letter, resume, and social media to support them in finding a job.   \r\nMeetups gather at Code Guild in the evening which give alums the opportunity to network, contribute to projects, and ask questions.\r\n\r\nAlison Acuna",
        "author": "PDX Code Guild",
        "created_at": "2017-05-24",
        "favorites": 24,
        "home_page": false,
        "path": "/articles/job-advice/what-happens-after-graduation",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 43,
      "fields": {
        "title": "Code Guild Review",
        "slug": "code-guild-review",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2084.JPG",
        "body": "I was delighted to come across this review of PDX Code Guild on Course Report.  The authorÆs  experience differs from mine in terms of individual projects but really resonated in terms of class size, depth of material, and career support.\r\n\r\n \r\n\r\nôI had a great experience at PDX Code Guild. I just completed their 4 month Evening FullStack Development Program, which covers Python, Javascript, CSS/HTML, SQL and Django. The program emphasizes quality over quantity of work, so in each section we learned the basics of the technology, completed a small instructor led project, and then completed a custom custom design project, with input and guidance from our instructor. The projects I worked on are as follows:\r\n\r\n \r\n\r\nPython:\r\n\r\nTodo list/Task Manager\r\n\r\nWeather Forecast App using forecast.io\r\n\r\nMini HTTP Server\r\n\r\n \r\n\r\nHTML/CSS\r\n\r\nA personal portfolio website\r\n\r\n \r\n\r\nJavascript:\r\n\r\nYahtzee Game\r\n\r\nE-Commerce Front end using AJAX to query product info\r\n\r\n \r\n\r\nSQL:\r\n\r\nA SQL back end for the E-Commerce Project\r\n\r\n \r\n\r\nPython/Django\r\n\r\nBlogging Platform\r\n\r\nCapstone Project (mine was a recipe engine that created a cocktail recipe\r\n\r\nbook based on the ingredients you had on hand).\r\n\r\n \r\n\r\nThe classes are small (max of 12), so you get a lot of time with your instructor, and they are able to go in depth into software design concepts and design patterns. They also offer advice and career guidance, help you organize your LinkedIn and Github and provide professional headshots.\r\nI worked full time (as many of my classmates did), and the hours were long. There is no homework, but I think that in order to get the best results, one should set aside the 4 month period for learning. I spent many nights and weekends perfecting my projects, and it paid off. I received a job offer the day after class finished from the #1 firm I wanted to work for. I have also been contacted by recruiters in other local tech firms based on the strength of my LinkedIn and portfolio. I accepted the offer, which was more than a 50% raise from my current position. Fair warning, PDX Code Guild advises that it typically takes 3-6 months for a student to find employment after completion, so YMMV. They also advised not to take offers under a certain level (IÆll leave it to the Code Guild to provide that information), and the offer I received was over the number they recommended. Over all I am very happy, and would definitely recommend PDX Code Guild.ö\r\n\r\n\r\n Alison Acuna",
        "author": "PDX Code Guild",
        "created_at": "2015-05-12",
        "favorites": 30,
        "home_page": false,
        "path": "/articles/news/code-guild-review",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 44,
      "fields": {
        "title": "8 Rocking Capstones",
        "slug": "8-rocking-capstones",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2507.JPG",
        "body": "One of the benefits of a Code Guild education is our capstone process.  Our industry partners consistently share that Code Guid capstones are very advanced. We are extremely proud of our graduates and their successful capstone projects.\r\n\r\n \r\n\r\nIn no particular order, here is a sample of 8 recent capstone projects:\r\n\r\n \r\n\r\nSarah Fellows û Brenan Looms Website\r\n\r\nA full website with ecommerce functionality designed to suit client specifications.  \r\n\r\n \r\n\r\nShawn Waldow û Bashring.com\r\n\r\nA fantasy MMA App that allows MMA enthusiasts worldwide to bet on and play fantasy MMA.\r\n\r\n \r\n\r\nKatie Dover- Cupboard\r\n\r\nA recipe finder based on the ingredients in your cupboard.  Easy to use user-interface and beautiful design with flawless API integration.\r\n\r\n \r\n\r\nAndrew Theis û SeekHue\r\n\r\nA web app that deconstructs image files and analyze the pixel color values to create a ôhue-mapö.\r\n\r\n \r\n\r\nChris Knight û Aromatherapy.care\r\n\r\nA web app that will allow users to look up information about various essential oils.\r\n\r\n \r\n\r\nErin Fough û Bias-Tracker\r\n\r\nAn app designed to give a person the ability to track unconscious gender bias in an organizational setting.\r\n\r\n \r\n\r\nJustin Epperly û Shirt Factory\r\n\r\nA web app that allows users to upload an image, transform that image to ASCII art, and render the transformed artwork as an image on a shirt.\r\n\r\n \r\n\r\nAlison Acu±a û Community CRM\r\n\r\nThe Community CRM is a tool that tracks member engagement through a member engagement score and helps community managers decide how to increase engagement.",
        "author": "PDX Code Guild",
        "created_at": "2015-02-05",
        "favorites": 9,
        "home_page": false,
        "path": "/articles/news/8-rocking-capstones",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 45,
      "fields": {
        "title": "Making Your First Open Source Contribution on GitH",
        "slug": "making-your-first-open-source-contribution-on-gith",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2091.JPG",
        "body": "Miguel Grinberg gave an amazing talk at Open Source Bridge about Making Your First Contribution on GitHub.  I have been encouraged to contribute to open source projects but wasnÆt sure precisely how.  Here are 5 things that struck me about his talk + a link to the video so you can watch it start to finish.  \r\n\r\n \r\n\r\nLook for a project to contribute to that has between 100 and 1000 starts.  A project with more than 100 stars is one that other people contribute to. The creator therefore has experience working with contributors.  From MiguelÆs perspective, less than 1000 stars indicates that the project is still manageable for the creator.  \r\nImposter syndrome holds people back from contributing to open source.  The desire to contribute to open source is sufficient proof that you are good enough.  Fixing typos in the ReadMe is an appropriate and acceptable contribution to an open source project.\r\nIf you find a project you want to contribute to, feel free to lurk for a bit.  Lurking shows you how people contribute, how decisions are made, and how they progress.\r\nBe a good guest.  In the same way that you follow the customs of the house in which you are a guest, follow the customs of the project to which you are contributing.  By accepting the code, the maintainers of the project are agreeing to maintain it forevermore.  It needs to be designed in a way that is comfortable for them to maintain.\r\nWatch this video from Miguel for step by step instructions about how to make the pull request, make changes, and submit it for approval.  https://www.youtube.com/watch?v=-e5xeKt0ztU",
        "author": "PDX Code Guild",
        "created_at": "2017-01-10",
        "favorites": 20,
        "home_page": false,
        "path": "/articles/news/making-your-first-open-source-contribution-on-gith",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 46,
      "fields": {
        "title": "Quick Notes: GitHub",
        "slug": "quick-notes-github",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-DSC03525l.jpg",
        "body": "Quick Notes are designed to be a helpful reference for someone who has learned about a subject but not yet memorized the material.  Text in blue is user dependent.  Text in green changes and can be pulled from a set number of options.  \r\n\r\nI crafted these for my setup which is a Mac OS, Atom text editor with fish installed.  I hope you find them useful as well.  However, if these particular instructions donÆt work for you, you may find the basic structure of crafting quick notes valuable even if these particular quick notes arenÆt right for your set up.\t\r\n\r\nGitHub Commit New\r\n\r\n \r\n\r\nIn Terminal:\r\n\r\n \r\n\r\necho ôfile nameö >> .gitignore\r\n\r\n \r\n\r\ngit init\r\n\r\n \r\n\r\nOn GitHub:\r\n\r\n \r\n\r\nCreate a new repository on GitHub\r\n\r\n \r\n\r\nIn Terminal:\r\n\r\n \r\n\r\ngit remote add origin url  \r\n\r\n \r\n\r\ngit remote add .\r\n\r\n \r\n\r\ngit commit- m ômessageö\r\n\r\n \r\n\r\ngit push û u origin master\r\n\r\n \r\n\r\nGitHub Update\r\n\r\n \r\n\r\ngit add .\r\n\r\n \r\n\r\ngit commit -m ômessageö\r\n\r\n \r\n\r\ngit push û u origin master  \r\n\r\n \r\n\r\nOther git push options I use frequently\r\n\r\n \r\n\r\nProfile Site:\r\n\r\n \r\n\r\ngit push -u gh pages master\r\n\r\n \r\n\r\nProject Site:\r\ngit push -u origin gh pages",
        "author": "PDX Code Guild",
        "created_at": "2016-01-08",
        "favorites": 23,
        "home_page": false,
        "path": "/articles/news/quick-notes-github",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 47,
      "fields": {
        "title": "Loved and Learned at StartUp Weekend",
        "slug": "loved-and-learned-at-startup-weekend",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2626.JPG",
        "body": "Participating in StartUp Weekend Seattle: Data Science was one of the most fun and challenging parts of my time during Code Guild.  StartUp Weekend is my kind of fun.  The challenge is to build a startup û business plan, MVP, and pitch û in 54 hours.  \r\n\r\n \r\n\r\nLoved:\r\n\r\n \r\n\r\nBeing in a room with so many other hustlers.  It takes a special kind of drive (or maybe a special kind of crazy?) to spend your weekend at StartUp Weekend.  The people I met were driven, creative, energetic and so, so kind.\r\n\r\n \r\n\r\nWalking into a room and introducing myself as a developer.  This was powerful!  Up until this point, I introduced myself as a student.  At StartUp weekend, I introduced myself as a developer û and nobody questioned me.  It was a huge confidence boost as I prepare to start job hunting.\r\n\r\n \r\n\r\nTaking on a big project and testing myself.  There were no teachers or tutors at StartUp Weekend.  I ended being the only developer on my team.  I wanted the challenge so I volunteered to create the website. . .by myself. . .in a weekend.  It was incredibly satisfying to stretch myself and see what I can do.\r\n\r\n \r\n\r\nLearned:\r\n\r\n \r\n\r\nCodeGuild has taught me so, so much.  To be clear, I knew going in that I had learned a ton during the bootcamp.  I donÆt think I truly understood the complexity of what I had learned.\r\n\r\n \r\n\r\nAt one point, some of my team members offered to help.  I am pretty good at delegating and teaching so I figured I could quickly teach them some basic CSS and get their help on the front end while I continued to work on the backend.  I could not.  What I have learned through Code Guild is more complex and valuable than I realized.\r\n\r\n \r\n\r\nI have so much more to learn.  There were times when I felt like an awkward, adorable adolescent labrador û you know that stage when their feet are too big for their body?  That was me.  I knew enough to create the website but am still learning best practices, efficiency tricks, and how to appropriately estimate project length.\r\n\r\n \r\n\r\nA ton about working with a team.  For this project, I got to work with designer, a business team, data scientists, and the project visionary.  Everyone had different priorities, areas of expertise, and areas where they lacked expertise.  We worked together to bridge those differences and co-create an awesome project.\r\n\r\n \r\n\r\nI am now a complete StartUp Weekend Junkie and I canÆt wait for the next one.",
        "author": "PDX Code Guild",
        "created_at": "2015-03-30",
        "favorites": 20,
        "home_page": false,
        "path": "/articles/news/loved-and-learned-at-startup-weekend",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 48,
      "fields": {
        "title": "Quick Notes: Python Syntax",
        "slug": "quick-notes-python-syntax",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2622.JPG",
        "body": "Quick Notes are designed to be a helpful reference after a student has learned about a subject conceptually but who has not yet memorized the material.  Text in blue is user dependent.  Text in green changes and can be pulled from a set number of options.\r\n\r\n \r\n\r\nPython\r\nVariable\tname = x + y\r\ncookies = magic + sugar\r\nFunction\tdef name(parameters):\r\n           return parameters * 2\r\n\r\ndef bake(magic, sugar):\r\n           return magic * sugar\r\n\r\nConditional\r\nStatements\r\n\r\nif condition 1:\r\n         code to be executed if true\r\n\r\nelif condition 2:\r\n\r\n          code to be executed if condition2 is true\r\n\r\nelse:\r\n\r\n            code to be executed if both conditions false\r\n\r\nif cookies < 20:\r\n         bake more cookies\r\n\r\nelif cookies > 200:\r\n\r\n          feed cookies to Cookie Monster\r\n\r\nelse:\r\n\r\n           keep Cookie Monster away from the cookies!\r\n\r\nFor Loops\tfor item in sequence:\r\n           code to be executed\r\n\r\nfor cookie in cookie_list:\r\n           eat cookie",
        "author": "PDX Code Guild",
        "created_at": "2016-03-09",
        "favorites": 26,
        "home_page": false,
        "path": "/articles/news/quick-notes-python-syntax",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 49,
      "fields": {
        "title": "Code Guild Alumni Party",
        "slug": "code-guild-alumni-party",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-CodeGuildParty_40.jpg",
        "body": "\r\n\r\nGraduates from each of Code Guild’s graduating classes were invited. Students reconnected, played games, and talked about life after Code Guild. The Code Guild Alumni network was launched by and is entirely run by Code Guild alumni.\r\n\r\nAlums willingness to step up and launch an alumni network really highlights that: Code Guild is a community. Alums are invested in their alumni network. Alums are putting effort into staying connected to Code Guild even after graduating and getting hired.\r\n\r\nAn Alumni Network is valuable because it can help: Expand students and alums personal network. Help students and alums get jobs. Build the name recognition and the perceived value of the Code Guild experience. Code Guild Alums stay connected through a slack channel as well.\r\n\r\nTypical topics on the Code Guild Alumni Slack Channel include: Job opportunities. Cool conferences and tech experiences. Updates about Code Guild happenings like graduation.",
        "author": "PDX Code Guild",
        "created_at": "2016-12-21",
        "favorites": 25,
        "home_page": false,
        "path": "/articles/news/code-guild-alumni-party",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 50,
      "fields": {
        "title": "Link Round-Up: CSS",
        "slug": "link-round-up-css",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-IMG_3301.JPG",
        "body": "Code Guild is community devoted to continuous education. Here is a round-up of articles on CSS topics curated by Code Guild instructor, Andrew Hedges.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nA Different Perspective on the !important Declaration: it might be useful\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
        "author": "PDX Code Guild",
        "created_at": "2017-12-19",
        "favorites": 27,
        "home_page": false,
        "path": "/articles/job-advice/link-round-up-css",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 51,
      "fields": {
        "title": "Link Round Up: Javascript",
        "slug": "link-round-up-javascript",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2075.JPG",
        "body": "Code Guild is community devoted to continuous education. Here is a round-up of articles on JavaScript topics curated by Code Guild instructor, Andrew Hedges. I have used these articles for interview prep as well as broadening my knowledge of the field and Javascript.\r\n\r\n10 Concepts Every JavaScript Developer Should Know \r\n\r\n\r\n\r\n: Closures are functions that refer to independent (free) variables. In other words, the function defined in the closure ‘remembers’ the environment in which it was created.\r\n\r\n",
        "author": "PDX Code Guild",
        "created_at": "2017-04-11",
        "favorites": 20,
        "home_page": false,
        "path": "/articles/news/link-round-up-javascript",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 52,
      "fields": {
        "title": "Roy Torley: Gentleman Scientist",
        "slug": "roy-torley-gentleman-scientist",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-close-up-of-black-computer-keyboard.jpg",
        "body": "Roy Torley is a current student in the night camp. At 64 years old, he has a PhD in Geology which – among other things – means that he can use the shape of a an individual grain of sand to determine where it comes from. So cool! Unfortunately, his PhD has not led to career stability. He has taught at various community colleges and started a tutoring business: Dr. Roy Torley, gentleman scientist. Eventually, he decided he needed to walk away from the ivory tower and get more real-world skills.\r\n\r\nRoy chose Code Guild because it is well organized, because he was able to get a scholarship to attend, and because the teachers here were able to teach him a lot about modern programming. For Roy, the goal of attending Code Guild is “to get a living wage job using skills and talents that I have. I want to enjoy a good long career with the security of a living wage.” Even better, he looks forward to having more capacity to entertain and enjoy the good life.\r\n\r\n“The older I get, the more social I become and the more I look for community.” Passion for learning and knowledge Roy gets an expression of pure delight when he is talking about gaining knowledge. Learning and teaching are lifelong passions for Roy. Dating back as early as Kindergarten, Roy took it upon himself to teach the other kids. Looking towards the end of life, Roy said that “Some people say that: He who dies with the most toys, wins. I disagree. Winning is having the most knowledge – his biggest toy!.”\r\n\r\nExperience of an older student I asked Roy what it is like to be the oldest student in the class. He was pretty nonchalant about it and said “Age doesn’t affect my experience as a student. I was the oldest student in my graduate years.” Being in class with him, I can really see how his knowledge of older programming languages serves his learning process. Roy has the background to make connections between the modern programming languages we are learning and the larger programming discipline. The class as a whole benefits from Roy’s understanding of the broader context of development and his willingness to step up to the whiteboard to teach the rest of us.",
        "author": "PDX Code Guild",
        "created_at": "2016-08-15",
        "favorites": 4,
        "home_page": false,
        "path": "/articles/news/roy-torley-gentleman-scientist",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 53,
      "fields": {
        "title": "Quick Notes: Navigating the Terminal",
        "slug": "quick-notes-navigating-the-terminal",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-close-up-of-black-computer-keyboard_doqb1WR.jpg",
        "body": "Quick Notes are designed to be a helpful reference after a student has learned about a subject conceptually but who has not yet memorized the material.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
        "author": "PDX Code Guild",
        "created_at": "2017-11-02",
        "favorites": 12,
        "home_page": false,
        "path": "/articles/news/quick-notes-navigating-the-terminal",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 54,
      "fields": {
        "title": "5 Tips to Prepare for a Technical Interview",
        "slug": "5-tips-to-prepare-for-a-technical-interview",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-young-woman-sitting-on-sofa-and-writing-in-notebook_gFItovq.jpg",
        "body": "Technical interviews are somewhat unique to the programming world. They can include whiteboarding, knowledge-based questions, and brain teasers. Technical interviews are designed to test technical knowledge and how you handle pressure.\r\n\r\nTechnical interviews are a space that give partial credit – get all the credit you can by following the following tips. \r\n\r\n. Remember that one of the big things these interviews are designed to assess is how you deal with pressure and not knowing the answer. They will often get progressively harder specifically to get you into a space where you don’t know the answer. Don’t argue with the interviewer about the quality of the question.\r\n\r\n. Ask clarifying questions and for context as needed. This demonstrates that you are comfortable asking for help, allows you to have a dialogue with the interviewer, and gain context if you aren’t certain what is being asked. Walk the interviewer through your thought process. If you know the answer, it is important to show how you got to the answer. If you don’t know the answer, talk the interviewer through what you do know and how it applies to the question or how you would go about getting the answer.\r\n\r\n. It is better to demonstrate that you understand the underlying logic but can’t remember the syntax than to leave the question on the table. Practice the following phrases. Practicing how you will handle getting stumped is a good way to ensure that you keep a cool head when it happens. I don’t know but here is how I would get the answer. . . I am excited to learn more about that topic. Here is how I would go about learning more . . . I don’t know but drawing from my knowledge of these related topics I would guess . . .",
        "author": "PDX Code Guild",
        "created_at": "2017-07-18",
        "favorites": 13,
        "home_page": false,
        "path": "/articles/job-advice/5-tips-to-prepare-for-a-technical-interview",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 55,
      "fields": {
        "title": "Link Round-Up Becoming a Better Programmer",
        "slug": "link-round-up-becoming-a-better-programmer",
        "category": 2,
        "background_img": "",
        "body": "\r\n\r\nHere is a round-up of articles on CSS topics curated by Code Guild instructor, Andrew Hedges. These articles are particularly useful for understanding how developers think and navigate the professional landscape.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
        "author": "PDX Code Guild",
        "created_at": "2017-10-02",
        "favorites": 5,
        "home_page": false,
        "path": "/articles/job-advice/link-round-up-becoming-a-better-programmer",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 56,
      "fields": {
        "title": "Resources to Build your Portfolio: Free Code Camp",
        "slug": "resources-to-build-your-portfolio-free-code-camp",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2073.JPG",
        "body": "Alumni, recruiters, and teachers have each highlighted how important a portfolio is to getting hired. At a recent alumni event, I had the chance to talk to alums about resources they would recommend to build a portfolio in addition to the work that we do in class.\r\n\r\n\r\n\r\n\r\n\r\n Mission Statement: Free Code Camp is a community of 200,000+ developers. Students learn to code and learn full stack JavaScript. They build a portfolio of apps that solve real problems for nonprofits.\r\n\r\nWhat does participation look like: “Once you finish the first three certifications, you’ll get to build a series of solutions for nonprofits. You’ll work in pairs, under the supervision of a volunteer project manager and a stakeholder from the nonprofit.” ~  Code Guild Alums recommend Free Code Camp because: “I loved it though. It is refreshing and a nice change from video tutorials. I enjoy coding challenges and Free Code Camp adds the certificates as an incentive. . . (and) The exercises are challenging.” Micheal",
        "author": "PDX Code Guild",
        "created_at": "2016-06-15",
        "favorites": 3,
        "home_page": false,
        "path": "/articles/job-advice/resources-to-build-your-portfolio-free-code-camp",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 57,
      "fields": {
        "title": "Resources to Build your Portfolio: StartUp Weekend",
        "slug": "resources-to-build-your-portfolio-startup-weekend",
        "category": 2,
        "background_img": "",
        "body": "Alumni, recruiters, and teachers have each highlighted how important a portfolio is to getting hired. At a recent alumni event, I had the chance to talk to alums about resources they would recommend to build a portfolio in addition to the work that we do in class. Alums recommended Hack Oregon, Free Code Camp, and StartUp Weekend.\r\n\r\n\r\n\r\n\r\n\r\nStartUp Weekend: In just 54 hours, you will experience the highs, lows, fun, and pressure that makeup life at a startup. As you learn how to create a real company, you’ll meet the very best mentors, investors, co-founders, and sponsors who are ready to help you get started. What does participation look like:\r\n\r\n\r\n\r\nDay 2: Learn & Work Learn from the Best – local mentors provide coaching Get to Work – resources and support in place to make things happen in a short period.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nI actually talked directly to Sheri, the Code Guild director, about StartUp Weekend because she was the StartUp Weekend Portland organizer for years. She said: “I recommend Startup Weekend because it’s a great opportunity to get a Minimum Viable Product on your portfolio in just 54 hours, meet a team of programmers that you may wish to continue to code with after the weekend. This will offer more portfolio opportunity that includes teamwork skills + code for your portfolio. The weekend is sponsored by companies that are hiring tech talent and using the weekend as a way to recruit. It also is an exhilarating weekend that often leaves participants feeling great about what they were able to accomplish; it can be a great confidence booster.”",
        "author": "PDX Code Guild",
        "created_at": "2017-11-21",
        "favorites": 15,
        "home_page": false,
        "path": "/articles/job-advice/resources-to-build-your-portfolio-startup-weekend",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 58,
      "fields": {
        "title": "5 Considerations to Make your Capstone even more A",
        "slug": "5-considerations-to-make-your-capstone-even-more-a",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2161.JPG",
        "body": "Every PDX Code Guild concludes with a capstone which gives students the opportunity to reinforce and demonstrate learning. The capstone has been one of my favorite parts of my Code Guild experience. I am really enjoying creating something and being in a space of more self-directed learning. I had the opportunity to attend Demo Day for the previous class. I saw some amazing projects and heard from graduates about lessons learned.\r\n\r\n\r\n\r\n\r\n\r\nThe most impressive projects were visually striking. They included photography and clean interfaces. Scale your MVP down to the smallest possible MVP – then scale it down again. Four weeks is not a lot of time to put together a beautiful, functional, non-glitchy, project that has been deployed the server. The most successful projects start with a small project and stay focused on that until the MVP is done.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nSome APIs are free to use with great documentation. Others are extremely expensive. Others won’t grant access. Projects that rely on a particular API can get significantly delayed by negotiating with a particular API. Craft a project that includes a database, Django, and Javascript. Code Guild sets the expectation that students will incorporate a full stack in their capstone project. The project will need to include a database and front end interaction.",
        "author": "PDX Code Guild",
        "created_at": "2017-01-18",
        "favorites": 21,
        "home_page": false,
        "path": "/articles/job-advice/5-considerations-to-make-your-capstone-even-more-a",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 59,
      "fields": {
        "title": "Quick Notes: Javascript Syntax",
        "slug": "quick-notes-javascript-syntax",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-DSC03539.psd",
        "body": "Quick Notes are designed to be a helpful reference for someone who has already learned about a topic conceptually but has not yet memorized the material.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n if (condition) { code to be executed if true; } else if (condition 2){ code to be executed if condition2 is true; } else { code to be executed if both conditions false; }\r\n\r\n if (doughnuts < 20) { bake more doughnuts; }else if (doughnuts > 100){ eat more doughnuts; } else { take a nap; } For Loops for (starting condition; condition for loop to run; the counter){ code to be executed } For Loop Example for (i=0; i<20 ; i+){ bake more doughnuts; }",
        "author": "PDX Code Guild",
        "created_at": "2015-09-22",
        "favorites": 18,
        "home_page": false,
        "path": "/articles/job-advice/quick-notes-javascript-syntax",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 60,
      "fields": {
        "title": "Sheri Dover, PDX Code Guild CEO + Portland Tech In",
        "slug": "sheri-dover-pdx-code-guild-ceo-portland-tech-in",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-sheri.jpg",
        "body": "Sheri Dover moved to Portland in 2011, the year Puppet was founded. At that time, the startup scene in Portland was fairly non-existent. However, Sheri was undeterred by the lack of an established scene. She had already fallen in love with technology as a tool for economic empowerment. Her passion for technology, eye for community development, and collaborative leadership style have helped to make the Portland tech scene what it is today.\r\n\r\nTo grow a tech scene, Sheri believed that Portland needed mentors and space where people were interested in startups. By nurturing an environment that was supportive of tech, Portland would be ready when VCs started to looking for places to invest outside the Bay Area. Sheri jumped into creating a tech-focused, mentor-rich space by organizing StartUP weekend for 5 years as well as by getting involved with TIE Oregon. While she worked with these organizations, Portland developed from a place where a person couldn’t really start a startup, to a place where a person could, to a place that with the opposite problem – thriving startups but a dearth of talent to work in the tech industry.\r\n\r\nThe talent crisis started in 2012. Companies competing to attract talent were in an arms race to offer the best perks. It was unsustainable. It also had the potential to damage the tech scene because if companies couldn’t attract talent here, they would have to go elsewhere. In speaking with her network of startup enthusiasts, Sheri decided that Portland needed to grow its own talent A friend recommend Sheri start a bootcamp and shortly thereafter PDX Code Guild was born.\r\n\r\nThree years later, PDX Code Guild is not an experiment anymore. It is an established developer of tech talent and Sheri is an established CEO. Sheri loves her work. It is the perfect balance of big-picture thinking and impact on the individual. She loves seeing the transformation in people as they go from novice often feeling stuck in a dead-end job to a junior developer with the opportunity for a career. She also loves knowing that she is creating jobs. Like every other project, she has led, PDX Code Guild also provides community space. “Half of our square footage is community space because it is so important. It is part of what gives us soul.” I have every confidence that whatever challenge the Portland tech scene faces next, Sheri will be crafting the communities that address it.",
        "author": "PDX Code Guild",
        "created_at": "2017-03-21",
        "favorites": 20,
        "home_page": false,
        "path": "/articles/job-advice/sheri-dover-pdx-code-guild-ceo-portland-tech-in",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 61,
      "fields": {
        "title": "5 Tips to Navigate a Career Fair",
        "slug": "5-tips-to-navigate-a-career-fair",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2176.JPG",
        "body": "I find career fairs to be a bit overwhelming. Me being me, I responded to that overwhelm by jumping in and learning more! I did a bunch of research, organized the career fair for the ACT-W: Women in Tech conference, and attended the career fair to support people impacted by the Intel lay offs. I am sure there are a few more career fairs in my future. The biggest thing I have learned about career fairs is that people actually do get hired from them.\r\n\r\nI graduated from college smack dab in the middle of the ‘08 recession. At the time, career fairs were non-existent. I have recently talked to a number of people who did get hired for tech jobs through career fairs. Go to Career Fairs. Every opportunity to job hunt increases your chances at getting hired. Research the companies in advance. Researching helps you create a plan of attack. Which companies do you most want to meet? What are the most valuable few questions you can ask?\r\n\r\nAs someone who finds career fairs kind of overwhelming, a plan of attack let me set a goal for what I needed to do before I could call the career fair a win and go home. Practice your elevator pitch until it is comfortable. Ideally, you will get to a point where you can weave your elevator pitch into conversation naturally. Dress professionally, bring resumes and business cards. Do what you need to get the most out of the experience. Some ideas: Take breaks if you need to – I did. Bring your cheering section if you need to – I saw whole families waiting outside the career fair waiting to cheer on their breadwinner. Buddy up with a fellow job seeker. Talk to companies you never want to work at to get practice and calm down.",
        "author": "PDX Code Guild",
        "created_at": "2015-11-18",
        "favorites": 19,
        "home_page": false,
        "path": "/articles/job-advice/5-tips-to-navigate-a-career-fair",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 62,
      "fields": {
        "title": "5 steps to a better GitHub Profile",
        "slug": "5-steps-to-a-better-github-profile",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2134.JPG",
        "body": "Earlier this week, we talked about what Github is and how it can be used as a tool to find a job. In this post, we are going to talk about how you can have a strong GitHub profile even as a beginning developer.\r\n\r\n\r\n\r\nThe first things you post as a student will likely not be the best code you ever write. Post them anyway. As you learn, make changes to demonstrate how you are improving. Notes on why you made those changes will demonstrate how you think about your work.\r\n\r\n\r\n\r\nGitHub gives a “green” status to people who upload something daily. A green status is valuable because it demonstrates that you code daily which shows commitment. Pushing edits is okay – you don’t necessarily need to push something new every day. A great way to keep your GitHub Green is by contributing to open source projects because it: Demonstrates an ability to collaborate. Can indicate a higher level of quality because the leader of the project will check code before integrating it. You don’t have a personal project at the moment.\r\n\r\n\r\n\r\nInclude a readme file and git ignoring files that shouldn’t be included in the post. 4) Link to your GitHub from your LinkedIn profile, portfolio, and resume. This ensures that prospective employers and collaborators can find it easily. 5) Write clear commit messages. Include details about what you changed since the last commit that will be clear to you and fellow developers.\r\n\r\n",
        "author": "PDX Code Guild",
        "created_at": "2017-06-20",
        "favorites": 22,
        "home_page": false,
        "path": "/articles/news/5-steps-to-a-better-github-profile",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 63,
      "fields": {
        "title": "Luke Hammer: Family Man and Code Guild Alum",
        "slug": "luke-hammer-family-man-and-code-guild-alum",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2006.JPG",
        "body": "Luke is a family man. He was a fairly typical college student – pursuing a BA in Communications and smitten with his college sweetheart. Luke and his sweetheart, Toni, decided to get married.\r\n\r\nThey couldn’t afford to both be in school at the same time so Luke dropped out to support his young wife as she finished her BA. A few years later, Toni had graduated and Luke was working nights for UPS. He was able to return to school and finish out his BA. By this time, they had two little ones and Luke was committed to providing a good life for his children. After 6 months of job hunting, it was clear that the BA was not paying off with a job.\r\n\r\nLuke enrolled in the night class at Code Guild. In speaking with Luke, I was incredibly impressed by his grit and determination. He worked, attended classes, was an active and involved Dad, and was diagnosed with diabetes. A typical day for Luke during this period looked like: 1pm Take kids to the park 2:30 Drive to Work 3pm Start work 5pm Drive to Code Guild 5:30 – 9:30 Code Guild 10pm – 4 am Finish Work After graduating from Code Guild, Luke interviewed with a wide range of companies. He walked away from an option to make 60k working in Salem.\r\n\r\nHe chose to work at Multnomah University because Multnomah University: Offers the flexibility which allows him to better connect with his family. Supports his continued learning. Ensures that the work he does contributes to a cause he believes in. Code Guild equipped Luke with skills that are valuable in the market which gave him the freedom to chose to work for an organization he believes in. Luke says the impact of Code Guild is that: “I look different. I feel and I look younger. My soul has recovered from being slowly poked. I hated being a part of a big organization where I couldn’t make an impact. Now – I push something and it moves! I can make significant changes here.”",
        "author": "PDX Code Guild",
        "created_at": "2014-08-22",
        "favorites": 32,
        "home_page": false,
        "path": "/articles/job-advice/luke-hammer-family-man-and-code-guild-alum",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 64,
      "fields": {
        "title": "License",
        "slug": "license",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2285.JPG",
        "body": "\r\n\r\n\r\n\r\n\r\n\r\nLicensing is an intensive process managed by the Oregon Office of Private Postsecondary Education. It takes about a year to complete the licensing process. Career and vocational schools in Oregon are required to be licensed by the commission’s Office of Private Postsecondary Education. The office is setup to protect student interests as education consumers.\r\n\r\n\r\n\r\nCode Guild is not in danger of being shut down. Licensed schools pay into a student tuition protection fund, which is available for students in the event of a school closure. Code Guild is eligible to accept scholarships and grants.\r\n\r\n\r\n\r\nUnfortunately, No. In fact, Portland Code School was not licensed and it did shut down unexpectedly. This left students without a clear path to graduate or get their tuition back. One way PDX Code Guild has demonstrated its commitment to delivering excellence in education is by becoming the only bootcamp in Oregon that has been operating legally since it’s inception. All aspects of PDX Code Guild including operations, financials and everything pertaining to protecting the educational investment of the students are inspected by the state on a yearly basis. PDX Code Guild prides itself on putting the student first.",
        "author": "PDX Code Guild",
        "created_at": "2016-04-25",
        "favorites": 14,
        "home_page": false,
        "path": "/articles/news/license",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 65,
      "fields": {
        "title": "Imposter Syndrome",
        "slug": "imposter-syndrome",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2109.JPG",
        "body": "\"Dearest Fear: Creativity and I are about to go on a road trip together. I understand you’ll be joining us because you always do. I acknowledge that you believe you have an important job to do in my life and that you take your job seriously. Apparently, your job is to induce complete panic whenever I’m about to do anything interesting—and, may I say, you are superb at your job. So by all means, keep doing your job, if you feel you must. But I will also be doing my job on this road trip, which is to work hard and stay focused.\"\r\n\r\n-Elizabeth Gilbert, Big Magic: Creative Living Beyond Fear Imposter syndrome is the feeling that one doesn’t deserve to be where they are in life.\r\n\r\nImposter syndrome can manifest as the sense that you fooled someone into giving you the opportunity they did. It can appear as the deep sense that your success is more to do with luck than skill. It’s estimated that 70% of people have imposter syndrome. People are more likely to experience imposter syndrome when they are feeling stretched. For example, when they are hustling a career change or learning something new. Attending a coding bootcamp can be a stretching experience. The experience of going from knowing very little about coding to knowing quite a bit about coding in a short period of time can be stretching. The experience of shifting one self-image to include developer can be stretching – especially if our cultural narrative suggested you might be better suited elsewhere.\r\n\r\nCode Guild is designed to support students in overcoming imposter syndrome. Being a classroom environment is helpful because knowing we’re not alone can be key to overcoming imposter syndrome. Code Guild specifically hires for teachers and TAs who are encouraging – who serve as cheerleaders as well as teachers. Code Guild promotes a diverse student body which helps me remember that people from any background – including mine – can be developers. I studied on my own for a few months before entering Code Guild. It is possible that I might have been able to teach myself everything I needed to know to be a developer. But I wouldn’t have gotten over the imposter syndrome.\r\n\r\n",
        "author": "PDX Code Guild",
        "created_at": "2017-06-07",
        "favorites": 35,
        "home_page": false,
        "path": "/articles/news/imposter-syndrome",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 66,
      "fields": {
        "title": "Top 5 Takeaways from Career Talk by Melinda Majors",
        "slug": "top-5-takeaways-from-career-talk-by-melinda-majors",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2488.JPG",
        "body": "Melinda Majors, Director of Recruiting for Cinder Staffing, http://www.cinderstaffing.com/ visited Code Guild to talk to students and alums about our upcoming career transition. Her experience spans both in-house HR positions and agency recruiting positions in technology and manufacturing. Cinder is a staffing firm that was formed as a resource for talent on demanding technical projects so staffing technical roles is a particular area of expertise for Cinder. In my day job, I teach resume and cover letter writing as well as interview and job hunting skills. Not knowing much about Melinda or Cinder Staffing before she arrived, I wasn’t sure if I was going to learn much from attending a talk on job hunt skills. I learned a ton. It was so valuable to get advice specifically tailored to the particular career transition Code Guild students are navigating and this moment in the hiring market.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nRecruiters are actively trying to fill jobs. It is their job to know what the company is looking for and recommend a number of qualified applicants. Resumes should highlight your technical experience but can include your former career. This gives employers a sense both that you can do the technical work and also a sense of who you are. In an employment market that increasingly interested in cultural fit, who you are matters. As I interpreted that advice, I envision filling the top half of my resume with technical projects but also including the basics of the work that I have done leading up to the career shift.\r\n\r\n\r\n\r\nMelinda called out that including an objective could be perceived as a little “old school”. From her perspective, it also provides context for why someone with a perfectly good career in higher ed might up and decide to become a back end web developer. . . for example. The more relevant technical skills you can highlight the better. The skills can come from previous work, your capstone, a startup weekend, an internship, volunteering, or anything else that allows you to demonstrate passion for and experience with programming. Every little bit helps. It is worth highlighting the little experiences until you have bigger ones to highlight.\r\n\r\n\r\n\r\nI really appreciated Melinda’s transparency in general. In particular, she affirmed that different people give different career advice which can feel conflicting. She provided the context that different hiring professionals give different advice because they have different preferences and priorities. She recommended we select the advice that best represents your brand and try to work with professionals whose style and values align to yours.",
        "author": "PDX Code Guild",
        "created_at": "2016-01-27",
        "favorites": 11,
        "home_page": false,
        "path": "/articles/news/top-5-takeaways-from-career-talk-by-melinda-majors",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 67,
      "fields": {
        "title": "Resources to Build your Portfolio: Hack Oregon",
        "slug": "resources-to-build-your-portfolio-hack-oregon",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-CodeGuild_2.jpg",
        "body": "Alumni, recruiters, and teachers have each highlighted how important a portfolio is to getting hired. At a recent alumni event, I had the chance to talk to alums about resources they would recommend to build a portfolio in addition to the work that we do in class. Alums recommended Hack Oregon, Free Code Camp, and StartUp Weekend.\r\n\r\n\r\n\r\nHack Oregon Mission Statement: Hack Oregon is a community-powered non-profit building civic data projects to promote engagement, awareness, and quality of life.\r\n\r\nWhat does participation look like: Hack Oregon “tries to keep everyone’s contribution between 5-10 hours per week. Part of that estimation includes pizza-fueled discussions during weekly in-person build sessions. If that’s not a fit for you (maybe you’re not local or have kids, or you just like to work alone) we can scale your participation to fit your lifestyle.” http://www.hackoregon.org/what-to-expect/ Code Guild Alums recommend Hack Oregon because  liked being involved with Hack Oregon because it is an opportunity to make an impact. The project they worked on last year – Raiseeffect.org – was mentioned in the legislature and contributed to the conversation about raising the minimum wage in Oregon. They highlighted it as a good portfolio-builder for recent grads because it is open source, published on GitHub, and an opportunity to work on a team.",
        "author": "PDX Code Guild",
        "created_at": "2017-04-12",
        "favorites": 23,
        "home_page": false,
        "path": "/articles/news/resources-to-build-your-portfolio-hack-oregon",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 68,
      "fields": {
        "title": "Why Students Come to PDX Code Guild",
        "slug": "why-students-come-to-pdx-code-guild",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-IMG_3303.JPG",
        "body": "We recently asked our students why they chose PDX Code Guild. Our question comes from our belief that developers not only need to program eloquent solutions to coding challenges but also be able to communicate their thoughts clearly using the written word. We are working hard to not just make developers but people companies want on their teams. Read how Pat Farnach puts it eloquently all together… Although there are a lot of web development bootcamps out there, the decision wasn’t too difficult for me.\r\n\r\nOne of the main draws to the school was the fact PDX code guild teaches Python which is a very prevalent, flexible language that’s used in and outside of web development. If I ever decide to go in an academic route, I’ll be well prepared to work with research data. Or if I just want to write scripts to run on my computer, I can do that easily with Python. I’m more interested in web development, but it’s nice to have options. I also like that the school is in Portland, OR, which is a great city that just so happens to have a burgeoning tech scene. Finding a job after the class will be much easier than if I had gone to school in other cities. Coming from Upstate NY, the weather here doesn’t really bother me, and there’s no shortage of entertainment, good beer, and nature within arm’s reach. Another thing that drew me to the school is the price. A lot, maybe most code schools, charge an exorbitant amount for 3-month classes with much higher student-to-teacher ratios. My class has 10 students, so that means we get a lot of one-on-one time with the teacher who really knows his stuff. So far I’m really happy with my decision to come to Portland to take this class and I’m excited to see where it takes me.",
        "author": "PDX Code Guild",
        "created_at": "2017-03-01",
        "favorites": 16,
        "home_page": false,
        "path": "/articles/news/why-students-come-to-pdx-code-guild",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 69,
      "fields": {
        "title": "Keep Your Day Job û Learn to Code",
        "slug": "keep-your-day-job-learn-to-code",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-IMG_9863_l3H2ARX.JPG",
        "body": "Not everyone can immerse themselves in a full-day bootcamp, which makes PDX Code Guild’s night class an excellent option for students with families or jobs.\r\n\r\nStudent Anne Woods gives us her insightful perspective as a full time employee who wanted to take her coding skills through a “major refresh”… Have questions about hiring our grads? Contact: kristin@pdxcodeguild.com.\r\n\r\n\r\n\r\n“I learned HTML and CSS around 2000, building sites in GoLive and Dreamweaver. I took a position at a company using an overseas development team. While I gained a lot of experience in writing directions, my coding skills atrophied. I realized my knowledge was outdated and I desperately needed JavaScript. I had no idea what web frameworks like Django were, or how modern non-CMS sites were built. I’d read reviews of other bootcamps where former students complained all they did in class was work thru online tutorials. I knew that was not for me. My brain works on a need-to-know-basis. I’ve gone through programming classes in the past and come out with an “A”, but with no feeling, I’d learned something I could apply in a real-world project. That’s NOT how we roll at PDX Code Guild! In the evening Web Development Bootcamp we work on a capstone project, almost from week\r\n\r\n1. This allows the student to ask the question first and then seek the answer, with plenty of support from the instructor and teaching assistant. This is the best way to learn. Find your curiosity and then focus is there. And as an added bonus, you get a finished project at the end for your portfolio. Would you rather explain to an interviewer how many hours you’ve spent learning from tutorials, or show a project you built from scratch? As I’m entering the final month of the bootcamp, I’m feeling like I’ve learned a lot, and I still have a ways to go. But I understand the web development landscape now. I can code in Python. I’ve worked on a Django project. I can write JavaScript functions. I wish bootcamp were longer! I feel like I’ve gotten a taste, and now I want a bigger bite.”",
        "author": "PDX Code Guild",
        "created_at": "2017-10-18",
        "favorites": 23,
        "home_page": false,
        "path": "/articles/job-advice/keep-your-day-job-learn-to-code",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 70,
      "fields": {
        "title": "My First Week at Code Guild",
        "slug": "my-first-week-at-code-guild",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-closeup-hands-on-laptop_4460x4460_vykToFO.jpg",
        "body": "Bootcamp is fast and intensive and we push our students do more than just code. Read how student Jordan Hewus describes coding, meet-ups, and the exhilarating end to frustration…. Since arriving at Code Guild, I’ve found myself finding enjoyment in strange unknown places. Walking into programming from day 1 has proven quite the experience for myself and my fellow classmates. From learning Python syntax to creating our own web apps, it has been a great change of pace from a the traditional collegiate setting. My first awesome moment was finishing an address book program from scratch. I first began by listing features I wanted to implement then used what seemed like limited knowledge and skills received in my short time here and ended up actually writing usable code. It was a great feeling to run my application and know that everything worked without error! The best part is, I now use this project app to store my family and friend’s contact info.\r\n\r\nI have also discovered Portland’s many Tech meet-ups. In my short time since relocating to Portland, I have attended various meet ups from “Learning Vim Text Editor” to “Perl Mongers”. Although I don’t understand everything talked about, I feel it’s important to socialize and network with others in the tech community. Not to mention I learned some awesome commands for VIM that I would have had no idea existed! Now don’t get confused as I might be making this all sound like a walk in the park. This has not been easy for me having started from the beginning with no prior programming knowledge. Programming can be very frustrating, which I’ve found by staring at my code for hours trying to figure out what went wrong, only to find my error and have it be something as simple as a small typo! But after all that frustration, finally seeing the light at the end of the tunnel is such a great feeling. I believe these frustrations only make me want to learn more!",
        "author": "PDX Code Guild",
        "created_at": "2015-04-03",
        "favorites": 15,
        "home_page": false,
        "path": "/articles/news/my-first-week-at-code-guild",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 71,
      "fields": {
        "title": "Class Structure",
        "slug": "class-structure",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2485.JPG",
        "body": "At Code Guild, there is a core curriculum that every class covers. Additionally, we hire the very best to teach and TA our classes so teachers have the freedom to customize projects to suit student needs.\r\n\r\nThe core curriculum includes everything necessary to start a career as a developer: HTML CSS Javascript Jquery Python Django Capstone Project At PDX Code Guild, we hire the very best to teach and TA our classes. We look for instructors who are : Knowledgeable Experienced in Tech Accepting and supportive Believe in the Code Guild values Cheerleaders as well as teachers Have an eye towards the job market and practical application Every instructor and TA is unique so every class will be a little different. Because of that, the following sample syllabus is just that – a sample. It is designed to give prospective students deeper insight into the Code Guild experience. Your experience will be different because it will be customized to your particular class.\r\n\r\nIn my class, most days started with an introduction of new topics through lecture. We then spent some time in lab, working on programming exercises. Most of our programming exercises were individual but we also completed exercises using pair programming and in groups. At the end of the course, we completed a capstone project, a full stack web application that incorporates everything you have learned in this course.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nDatabases and Deployment Schedule: Weeks 11.0 – 13.0 Topics: PostgreSQL, AWS, Docker Capstone Project Schedule: Weeks 13.0 – 16.0 *Note, this syllabus was crafted using a zero based numbering system. If you are new to a zero based numbering system, 0=1.",
        "author": "PDX Code Guild",
        "created_at": "2016-02-20",
        "favorites": 10,
        "home_page": false,
        "path": "/articles/news/class-structure",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 72,
      "fields": {
        "title": "Will there be homework at Code Guild?",
        "slug": "will-there-be-homework-at-code-guild",
        "category": 1,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2287.JPG",
        "body": "\r\n\r\nIt really depends on you. We hire the best at Code Guild and we give them the freedom to customize their teaching to suite their expertise and their student’s needs. As such, every class will be a little different and every student’s experience is going to be a little different. In my experience: One of the things that I most appreciated about my Code Guild experience is the balance between self directed autonomy and support from the school. There hasn’t been mandatory homework. I never take tests, never submit homework, and have not been chastised for not getting something done on time. I have time to complete assignments in every class. I have as much support as I need during class to complete assignments and access to free tutors outside of class if I need additional support. Nothing about the system requires me to work outside of class.\r\n\r\nI absolutely do work outside of class. I get the sense that my classmates do as well. We are not working to keep up (for the most part) nor are we working to hit milestones set by Code Guild. Rather, we are incredibly motivated to put together the best work we can. To understand concepts inside, outside, backwards and forwards. It took a lot of drive and determination to put my life on hold for 3-4 months for a code bootcamp. I want to make the most of that. I want to walk away from this experience with a portfolio I am proud of. While a Code Guild student, I am also working full time, run a non-profit, planning the career fair portion of ACT-W, and write for the Code Guild blog. Mandatory homework would be really difficult for me to complete. There are days – even weeks – where all I can give to my studies is the time I am in class. I really appreciate that the time in class is enough to understand the concepts and put together a solid body of work. I also appreciate that, when I do have the time, there are clear recommendations on how to use that time to do even better.",
        "author": "PDX Code Guild",
        "created_at": "2016-05-08",
        "favorites": 7,
        "home_page": false,
        "path": "/articles/news/will-there-be-homework-at-code-guild",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 73,
      "fields": {
        "title": "GitHub as a Career Tool",
        "slug": "github-as-a-career-tool",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-IMG_2083.JPG",
        "body": "\r\n\r\nGitHub is a web-based Git repository hosting service. It is used: As a cloud based backup for coding projects. To save versions of a project. To aid collaborations and open source projects. As proof that a job seeker can code. How is GitHub used as a career tool? A GitHub account can be used in conjunction with a LinkedIn profile, portfolio, and resume. Portfolio: More visually impressive and helpful for people who aren’t technical. GitHub: Helpful for a technical person who can use it to determine skill level. Resume: Demonstrates work experience. LinkedIn: Demonstrates personal brand and work experience github The first person you will likely talk to when interviewing for developer jobs will likely be not as technical and will not be likely to look at your GitHub account. At the point you talk to an engineer, they will look at your github, your linkedin, and your resume. GitHub demonstrates both skill level and growth. It showcases what you know. It also showcases how quickly you can learn and that you are capable of learning. Check back on Thursday for 5 steps to a better GitHub Profile.",
        "author": "PDX Code Guild",
        "created_at": "2017-10-18",
        "favorites": 26,
        "home_page": false,
        "path": "/articles/job-advice/github-as-a-career-tool",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 74,
      "fields": {
        "title": "PDX Code Guild Welcomes Grant Holly",
        "slug": "pdx-code-guild-welcomes-grant-holly",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-Artboard_13x.png",
        "body": "\r\n\r\nGrant has an extensive teaching background. Most recently, he was a technical trainer and consultant. (That basically means he got to fly around and teach people how to use new technology and help them integrate it into their systems.) When we asked him to share a bit about himself, he said: \"Some of my areas of expertise are databases, analytics, visualization, application development and support, and then throw in some networking, security, and admin stuff, sprinkle in a bit of hacking and that’s me\"\r\n\r\nIt’s a big fun mess. If you want to get to know this “big fun mess,” check out this post, or find him at our Junior Developer Bootcamp and Monday Python Flying Circus.\r\n\r\n\r\n\r\n I’m passionate about teaching first and foremost. Teaching web development is great because you get to see students make something that they can actually use. Web technology is also pervasive and in the forefront of our culture. Being able to dissect and understand the different working parts, well, let’s just say you’ll never see the web, or the world the same. For people with little or no exposure to coding, the idea of working on prime number factorization or sorting algorithms doesn’t have the same appeal as, say, “let’s make a web page where we can vote on and recommend everyone’s favorite bands.” Concerning Python, I think Python is a fun language to learn first. (To prove it, if you have Python – and you probably do – type “import antigravity” into the interactive prompt for a relevant XKCD. For the less adventurous, check out https://xkcd.com/353/.)\r\n\r\nOn a more serious note, traditionally a lot of Computer Science is taught bottom up. Students typically learn C/C++/Java, and they study compilers, a healthy dose of mathematics, they might even do some assembly code, then it’s on to algorithms, data structures, before they dive deeply into higher level languages like Python. This bottom up approach tends to have a high burn out rate or seems too intimidating. Being an interpreted language, Python obscures a lot of that for new programmers. It is a great language because of its human readability and clean syntax, which makes it amazingly approachable. For someone who has never written a line of code before, being able to watch your first program run is an exciting experience that more people should have.\r\n\r\n\r\n\r\n\r\n\r\nYou should join the Guild because you are a self-motivator and are ambitious. I think the kind of person that is drawn to PDX Code Guild is someone who has maybe tried learning coding, or some other facet of computing, on their own, but they want to go to the next level and take a really deep dive. People want to learn how to think like a programmer more than just parrot what other people do, and that can be hard to learn on your own without any guidance or mentor-ship. PDX Code Guild really stands out because we give people current industry dev skills, but also teach systems-thinking, how to reason programmatically. Additionally we don’t just teach students to use today’s technology, but to create it and make it their own.\r\n\r\n\r\n\r\nWhat stands out in my mind the most compared to the tech scene in other cities like San Francisco and Seattle is how welcoming and inclusive the community is here. For Portland’s size, there are a lot of really great active groups and meet-ups. I think that user groups can be really intimidating, or rather, there might be the expectation that they are unduly academic or technical, but here in Portland the community is very approachable and inviting to everyone.\r\n\r\n\r\n\r\nWhere do I begin? I have lived in the NW most of my life, so I think I’m kind of spoiled. Having traveled quite a bit, I was always happy to see Mt. Hood on my approach back into beautiful Oregon. My short list of what I love about Portland is our unique, open culture and general “be yourself, especially if you are weird.” I also love being close to everything (wine country, mountains, the ocean, the Columbia, the forest, just to name a few.) And, when it comes to this city, I can’t leave out eating out in Portland – and it’s not too hard on my wallet. Nowhere I’ve been beats dining in Portland.",
        "author": "PDX Code Guild",
        "created_at": "2015-02-10",
        "favorites": 17,
        "home_page": false,
        "path": "/articles/job-advice/pdx-code-guild-welcomes-grant-holly",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 75,
      "fields": {
        "title": "Branding for Brainiacs",
        "slug": "branding-for-brainiacs",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-young-woman-sitting-on-sofa-and-writing-in-notebook.jpg",
        "body": "\r\n\r\n\r\n\r\nJoin us for Branding For Brainiacs November 6th, 6:30pm @ PDX Code Guild Seats are limited; RSVP Here Startup founders rule. You are ready to reinvent the world with your brilliant idea for a startup. But to get your business off the ground you need to connect with customers. You need a brand. A brand is what the outside world thinks of you. It’s communicated in everything you do – from how you answer the phone, to the colors on your homepage, to the logo on your door. You need to figure out what you stand for and how that walks and talks. Your customers may care less about the nuts and bolts of your business than your colors.\r\n\r\nDid you know… 92.6% of people say that visual dimension is the #1 influencing factor affecting their purchase decision? People make a subconscious judgment about a product within 90 seconds of viewing? Up to 90% of that is based on color! Come to this workshop to learn how to build your brand, including: – How to choose your colors – How to choose your fonts – How to choose your images – How to develop your voice – How to build your logo – How to build your website, business card & other branding elements Walk away from this workshop with: – Your brand personality – Tools to build your brand and win business – The ability to think like a creative (even if you’re not) This workshop is presented by PrestoBox, the world’s first automated branding agency. What used to cost thousands of dollars and take months of time now can happen at the snap of your fingers.",
        "author": "PDX Code Guild",
        "created_at": "2015-09-20",
        "favorites": 15,
        "home_page": false,
        "path": "/articles/job-advice/branding-for-brainiacs",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 76,
      "fields": {
        "title": "PDX Code Guild Offers $25k in Development Services",
        "slug": "pdx-code-guild-offers-25k-in-development-services",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-IMG_9863.JPG",
        "body": "\r\n\r\nMore and more businesses want to incorporate web apps into their offerings, so PDX Code Guild is partnering with Portland Startup Weekend to offer the winner a development services package to help new business create their prototype. The PDX Code Guild team will help business founders further define what their app is, who will use it, and how it should work. After drafting some requirements, the PDX Code Guild team will start to put pen to paper, or rather, code to text editors, and build a prototype.\r\n\r\nThis provides startup founders with valuable knowledge of the technical scope of their app, as well as give them insight into how their app will work and what it will take to launch it. For the PDX Code Guild students, this gives them more hands-on learning and experience. “We think that one of the best ways of learning to code, is working on a project,” says Instructor and developer Grant Holly. “Our prize package is a win-win for startup founders and for our students who get ‘real-world’ hands-on experience not just coding, but the software development process,” he adds. If you are interested in learning the craft of coding, PDX Code Guild is offering an immersive 12 week session starting Jan 5th for the day class, and Jan 26th for the 16 week night class. Check out PDXcodeguild.com for details, or come by for one of their meetups on Monday night at 6.",
        "author": "PDX Code Guild",
        "created_at": "2014-02-12",
        "favorites": 20,
        "home_page": false,
        "path": "/articles/job-advice/pdx-code-guild-offers-25k-in-development-services",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 77,
      "fields": {
        "title": "A Day in the Life of a Developer",
        "slug": "a-day-in-the-life-of-a-developer",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-DSC03539l.jpg",
        "body": "My name is Joe Cardella and I’m a Software Developer at Portland Webworks in Portland, Maine (http://portlandwebworks.com). Here’s a little insight into how we develop our projects, which include custom mobile and enterprise web applications for clients ranging from local businesses to state governments and multi-national corporations.\r\n\r\n\r\n\r\nFor a typical week, the project managers allocate my time to various projects. I usually have just one major project at a time, but when my actual productive time on a project is low, say due to the project winding down or being in some kind of transition state, I may pick up a secondary project. If I’m between projects I’ll pick up various maintenance tasks, or provide estimates for projects our business development team is trying to win. We use a Scrum-based agile methodology that allows for transparent and reasonable project management.\r\n\r\nWhen I start a project, I will work with the others on the team and break the project down into features and tasks, divide the tasks among the team, and organize the tasks according to what features are most valuable to the client and what tasks are technically necessary to make the project work. We then estimate the time and effort needed to complete each task, and usually plan at least a few weeks into the future. Once that is done, we’ll take about two-weeks worth of work from the task list and get started. We’ll meet daily in the morning to discuss the previous day’s progress and what is planned for the current day, and then we just get to it. As for my particular role, I have a strong front-end skill set, so I tend to take on projects (or aspects of a project) with significant front-end needs. For example, my current projects are a re-skin of an AngularJS e-commerce web app and a Cordova/AngularJS mobile application. The web app is pretty much limited to HTML/CSS development, but with the mobile application I’m responsible for development of the UI, the Angular application, and the Java-based RESTful web services on the back end.\r\n\r\nOur tech stack of choice is HTML/CSS/JS using Bootstrap and AngularJS for front end, Java-based RESTful services for backend, and some sort of SQL database. Secondarily, we do a lot of Drupal projects, usually very large site conversions or sites which need some customization or additional application development on top of the Drupal platform. We use a lot of the tools du jour as needed, or as interested (haha), including SASS (css preprocessing), Grunt/Gulp (automating repetitive tasks), Bower (JavaScript dependency management), Yeoman (project scaffolding), Cordova (mobile app development), and others. As a part of the team, I’m expected to maintain my primary skill set while actively improving my skill with the elements of our tech stack where I am lacking experience. Currently, that means staying on top of CSS changes and techniques, becoming expert with AngularJS, and becoming proficient with Java. My personal goal is to get proficient enough with the entire tech stack and gain enough application experience to take on the architect role on a major project. The environment at Portland Webworks is very collaborative, open, and relatively stress-free, so there’s a lot of support when I’m working outside of my comfort zone.\r\n\r\nThe company keeps an eye on the number of hours people are working to avoid developer burnout and to catch project problems early, so that reasonable hours and client expectations are maintained. Our agile project management process goes a long way toward making all of this collaboration, skill development, and project work possible and manageable. I definitely recommend looking for companies that have invested in agile processes when searching for jobs. Links: Portland Webworks:  PWW Twitter: @portlandwebwork Personal Twitter: @joebot0101",
        "author": "PDX Code Guild",
        "created_at": "2016-03-25",
        "favorites": 28,
        "home_page": false,
        "path": "/articles/job-advice/a-day-in-the-life-of-a-developer",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 78,
      "fields": {
        "title": "Portland Startup Weekend 2014: Pitch. Build someth",
        "slug": "portland-startup-weekend-2014-pitch-build-someth",
        "category": 2,
        "background_img": "images/uploads/2018/09/28/bg-closeup-hands-on-laptop_4460x4460.jpg",
        "body": "\r\n\r\nWe had 3 of our current students and two Code Guild graduates participate in the weekend, as well as 2 of our Advisors. PDXShelter, a team led by PDX Code Guild student Matthew Fountain and aided by schoolmate Ryan Perkins was the top winner of the evening. Their social enterprise startup, an app designed to bring real time shelter information to the homeless, took both Best Overall and Best Customer Validation. The team contacted and worked with several homeless shelters around the city, learning and listening. The team found that most of the homeless either have a smart phone, or access to one – making the real time information useful and priceless. The end result is a mobile app with a mapping tool, which provides real time answers to whether there’s a bed for them to sleep in, if they accept pets, and all essential information to those living on the street. Fourteen different teams presented their MVP’s (minimum viable products) at Portland Startup Weekend. TinkleTime, a sensor which attaches to diapers, was awarded Best Business Model. SmartStream – a device created to monitor E. Coli levels in water in real-time won the award for Best Execution.",
        "author": "PDX Code Guild",
        "created_at": "2014-05-10",
        "favorites": 20,
        "home_page": false,
        "path": "/articles/job-advice/portland-startup-weekend-2014-pitch-build-someth",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 79,
      "fields": {
        "title": "The HONEST Truth About Bootcamps",
        "slug": "the-honest-truth-about-bootcamps",
        "category": 2,
        "background_img": "images/uploads/2018/12/03/bg-oppor.png",
        "body": "\r\n\r\nWhat is a Coding Bootcamp?\r\n\r\nA coding bootcamp is an intensive, technical program designed to teach programming skills that employers are looking for in a short amount of time. Coding boot camps are often attended by those with very little coding background who are interested in a career in tech. Tech jobs are in high demand, and extremely well paid, ranking in 8 of the top 15 jobs according to Glassdoor. After attending a good boot camp, students are equipped to apply for junior developer positions with a U.S. average salary of around $67,000 per year.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n3. Your chances of finishing Bootcamps specialize in getting students skills fast so they can start high-paying careers in as little as 12 weeks. Learning by other routes has an opportunity cost of missed wages and lost job experience while you are taking a longer, and often lest complete route to learn. Many students overestimate their self-discipline in self-paced programs and there’s a much higher drop out rate.\r\n\r\n\r\n\r\n\r\n\r\nThere are two times online learning is most useful. It’s great when someone is dabbling or learning what they can in preparation for a more robust course of learning, and when a programmer needs to brush up on some new syntax. Online courses will teach you mostly Syntax (the small differences in how each programming language is written) and you’re going to learn how the code is written, but you’re also going to have major gaps in important foundations. Working in teams simulates real work experience, problem solving under intense deadlines will also prepare you to manage the pressure that comes in this industry. We see so many students from online programs who take their time in self-paced programs, redoing the same problems over and over rather than adding to their stack. Many online bootcamps also make big promises, but be weary of ones that have “guaranteed job placement” or a “money back guarantee.” If it sounds too good to be true, it usually is. While these are enticing offers, many of these guaranteed jobs are low paying and not expanding your skill set the way you’re capable of. This will give you a platform to lead into tech, but for how much money you will spend and the amount of time it takes to get where you want to be may not be what you were expecting.\r\n\r\n\r\n\r\nIn the location you will be working from are often most recommended as there are many networking benefits by taking this route. A good programmer bootcamp like PDX Code Guild will have a strong, up-to-date curriculum taught in small groups by instructors with recent industry experience.\r\n\r\nThe curriculum will focus on the individual student solving coding labs mixed with team and pair projects. Knowledgeable instructors should be able to keep each student challenged so that each student gets as much out of the bootcamp as possible and never has to wait for the rest of the class to catch up to them. It should stay at an intense learning curve most of the time.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nIf you take a programmer bootcamp, you can have skills for a high-paying job in 12-24 months. In Portland, PDX Code Guild graduates make between $45,000 and $95,000 in their first year on the job. Each year they work as a programmer, their earning power goes up. After two or three years in the field, a backend developer can make between $90,000 and $120,000 per year in Portland. With such a high demand for quality programmers, almost every graduate who wants a job will find one. Your interviewing skills and ability to articulate your knowledge can greatly affect the range in offers you receive, and many times it takes 3-4 months to find the right job. The jobs are really a mixed bag. You will be well situated for a job in web development. Lots of people end up in engineer positions where they help clients install integrate software into their products. Lots go into dev ops, deployment, taking care of servers, software testing, Q&A positions, and IOT.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nIf you were to go to university instead of a bootcamp, you may lose out on a significant amount of money. For the four – five years you would be in college, you may miss out on between $245,000 and $435,000 plus what you pay for tuition and student loan interest. University CS degree programs were designed to train researchers and not programmers. They tend to focus on theory and most CS degree graduates only take one semester of actual programming.\r\n\r\nAt PDX Code Guild, we commonly hear from graduates of CS programs complain that they know a little bit of code, but don’t know how to start a project, and don’t know how to do all the bits and pieces you need to work as a programmer. Most bootcamp students already have a college degree, but if you don’t, and you want to get one, you may consider going to a bootcamp, working as a programmer, save your money for school and go later without having to take out huge loans. You’ll save a significant amount of interest and you may even be able to get your employer to pay for some of it.\r\n\r\n\r\n\r\n\r\n\r\nCommunity college classes move slowly. You can learn in one week at bootcamp what will take you a whole term in college (community or university). At a community college you learn job skills piece by little piece and it can take a couple years to gain entry-level job skills. It’s unlikely that you will get as strong as programming skills at a community college as you would in a good 12-week programmer bootcamp. Most technical classes at community colleges are designed to be transferred to a 4-year CS degree program or are for web development. In general you wont build the skills or portfolio you need for the higher-paying jobs at a community college, but if you find a good one, you will still lose approximately $100,000 - $165,000 in lost wages in the year and a half that you were studying longer than you would have been in a bootcamp.\r\n\r\n\r\n\r\n\r\n\r\nIf you don’t like to program, this would be a bad career choice. If you are easily frustrated by puzzles, if you don’t like to constantly learn new things, again not the best fit. Succeeding at a good bootcamp takes grit, determination and intrinsic motivation. Bootcamp is a very active learning environment and is best suited to hard-working, highly motivated students who can manage frustration, give themselves permission to make mistakes, and keep going. Bootcamp students who posses these qualities are rewarded with high-paying jobs in a field with excellent work conditions and often phenomenal benefits.\r\n\r\n\r\n\r\n\r\n\r\nLook for bootcamps that are licensed. Avoid bootcamps with too much pair programming, classes led by teaching assistants or graduates of their own program with no experience working as a programmer, lectures given by video or have large class sizes. These programs tend to be more focused on making a buck than quality bootcamp education.\r\n\r\n\r\n\r\n\r\n\r\nWe like to compare it to drinking from a fire hose! It can be intense trying to fit everything you need to learn into a 12-week course, but it’s a great community. We have a very caring, comfortable and welcoming environment with a small staff that gets to know all the students by name. It’s a really encouraging place and conducive to working harder than you ever have in your life in order to start your career. Besides the quality of content, it’s really the community that everyone talks about. The fact that you can walk in here anytime of day from 9am-9pm, 7 days a week and there is someone here that you can ask for help, hang out, or use the free WIFI to work. You can’t get that from an online course. If you’re considering a career in tech, it’s time to take the next step! No better time then the present. PDX Code Guild has new courses starting regularly, as well as a  to get you started. Why wait any longer? Your new and improved career is waiting!",
        "author": "Sheri Dover",
        "created_at": "2018-10-05",
        "favorites": 105,
        "home_page": true,
        "path": "/articles/job-advice/the-honest-truth-about-bootcamps",
        "categoryPath": "/articles/job-advice/"
      }
    },
    {
      "model": "article.article",
      "pk": 80,
      "fields": {
        "title": "All About Financial Aid",
        "slug": "Financial-aid",
        "category": 1,
        "background_img": "images/uploads/2019/11/14/bg-intro_to_programming_banner.png",
        "body": "\r\n\r\n\r\n\r\n   We strive to be as honest and transparent as possible. There are no marketing tricks here, but we can still make one promise. When you compare the quality of education and price, PDX Code Guild is a better value than our competitors. We’re authentic, 100% taught in-person by qualified instructors, (No class time spent taught by videos or T.A.'s!) local, and committed to serving our community.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nPDX Code Guild offers a very liberal needs-based discount. If your yearly household income is approximately 300% or less of the 2019 federal poverty level. You will qualify on a sliding scale. Sometimes a partial discount will be applied to applicants who exceed the income guideline if they have circumstances that create need. If you do qualify, tuition drops significantly. View the class page to see the rage of discounts that apply to each class. How-To Apply: Send an essay describing your financial need and any factors that contribute to your need for the discount and how you'll use the education to sheri@pdxcodeguild.com. \r\n\r\n\r\n\r\n\r\n\r\nOn occasion, a student will have a portion of their tuition that they pay out of pocket. If your out of pocket payment is $1,000 or more and you're able to pay it on or before the first day of class you qualify for an additional $500 discount.\r\n\r\n\r\n\r\n\r\n\r\nSkillsFund is a company that partners with specific, qualified bootcamps to offer private loans for tuition. Anyone can apply for this no matter his or her income level. The loan interest rates are competitive with private tuition loans you’d get through your bank, but the benefit is you only make principal payments while you’re in the bootcamp. Skills fund also offers a $7,500 cost of living stipend if you’re taking the day bootcamp. Principal payments don’t start until after graduation! Apply: You’ll need to be accepted into PDX Code Guild before you apply to know how much you’ll need to borrow. Again, we can walk you through this process.\r\n\r\n\r\n\r\n\r\n\r\nThere are numerous 3rd party grants available, and most of our students qualify for a grant to help pay tuition. A few of those grants come from • WorkSource • Trade Act • Workman’s compensation • And more. Make an appointment with an advisor to learn more. \r\n\r\n\r\n\r\n\r\n\r\nThis option is for those who do not qualify for the need-based discount, as the two cannot work together. Pay half tuition, $6,250, before class starts and then $125 payments monthly while you’re in class until you get a job. Once you get a job, payments will be 8% income, or $350, whichever is less.\r\n \r\n\r\n\r\n\r\n",
        "author": "Sheri Dover",
        "created_at": "2018-10-17",
        "favorites": 21,
        "home_page": true,
        "path": "/articles/news/Financial-aid",
        "categoryPath": "/articles/news/"
      }
    },
    {
      "model": "article.article",
      "pk": 81,
      "fields": {
        "title": "Cracking the Coding Interview: 6 Tips for Technical  Interviews",
        "slug": "tips-for-technical-interviews",
        "category": 2,
        "background_img": "images/uploads/2019/09/10/bg-blurred-background-casual-coffee-1125028.jpg",
        "body": "Congratulations!  You’ve landed that in-person interview! Tackling your first interview can be less nerve-racking when you know what to expect.  \r\n\r\nIt the programming world, each technical interview is unique, and may include anything from whiteboarding, knowledge-based questions and brain teasers designed to test your technical knowledge and how you work under pressure. The good news is that most technical interviews are designed to give you partial credit. Make sure you get all the credit you can by keeping in mind the following tips designed to help you ace your next technical interview. \r\n\r\n\r\n\r\n\r\n\t\r\n\t\r\n\t\r\n\r\n\r\nSpend a structured part of each day during your job search building your coding skills. Learn new skills by making web apps and building stuff rather than treading water in endless tutorials. \r\n\r\n\r\n\r\nFind out what they have asked in interviews in the past, what technologies they use, what they value and what the normal compensation is for the position you are applying for. \r\n\r\n\r\n\r\nMost tech companies start with a phone screening. They will ask questions about your skills and experience, get a general sense of who you are behaviorally and ask about your compensation expectations. Do not give the first number! Tell them that at this point you are most interested in finding out how you fit in the company and how you can add value to a team there. They will ask you again right before they offer you a job. At that point, you might tell them that you don’t have that number at this time and that it will partially depend on the benefits package. You may also say that “I’m looking for the normal market rate for the position”. \r\n\r\nThe next step is usually an off-site tech challenge. The company will send you one or more tech challenges or short projects to solve in a given time frame. It’s perfectly acceptable to ask questions about what to expect in the challenge before you start. It shows that you think ahead. Again, reading about the company’s interview process on Glassdoor can help. \r\n\r\n\r\n\r\n\r\n\r\n\r\n\t\r\n\t\r\n\t\r\n\r\n\r\nTechnical interviews are designed to find out what you know, how you solve problems and how you work under pressure. It’s completely okay and normal to not know the answer to everything. You probably know something related to the question. If you don’t know an answer, talk about what you do know about the topic. Show what you know by keeping the dialog going. Keep calm by practicing your breathing, ensuring that you’re maintaining an even tempo. Whenever you feel the nerves start to get to you, smile like you mean it! When you smile, it tends to put your interviewer at ease which in turn will help you to feel at ease too. \r\n\r\nThe questions and problems you’ll be presented with will inevitably get progressively harder in order to test where your knowledge starts and stops. Talking through your thought process and writing out your work are sure-fire ways to keep a calm head. \r\n\r\n\r\n\r\nIf you get stuck, take a breath and let your interviewer know that you’re nervous. It helps fill in what could otherwise be silence and reminds the interviewer that you probably know more than you’re able to say.  \r\n\r\n\r\n\r\nYour interviewer is looking for skilled communicators and collaborators. If you need clarification, ask! This opens up a dialogue with the interviewer while gaining context if you need a little assistance. Don’t discount your interviewer- they’re an important resource! \r\n\r\nWhen all is said and done, your interviewer is someone who you may be working with every day. Even if you missed a few questions, the overall connection that you make should be positive as they are looking for someone who can elevate their team. If you’re anxious about small talk, a good tip is to practice a 30 second elevator pitch for when you’re asked to talk about yourself at home.\r\n\r\n\r\n\r\n\r\n\r\nIt’s better to demonstrate that you understand the underlying logic - even if you can’t remember the syntax - than it is to leave the question on the table. Practicing how you will handle getting stumped is a good way to ensure you prevail should it actually happen. Saying, “I’m not sure but drawing from my knowledge of these related topics I would guess the answer may be…” is a much better way of answering interview questions than just saying, “I don’t know.” Mastering this form of answering demonstrates that you are thinking creatively outside the box and drawing on your knowledge and that you’re not content with giving up. Interviewers are looking for candidates who show drive, grit, and initiative like this. \r\n\r\n5. Leave arrogance at the door, but still get a leg up by allowing the interviewer to see you as a rockstar for multiple projects. \r\n\r\nTop candidates are eager to learn, adaptable, and resilient to the ever-changing environment of technology and business needs succeed. The humbler and more eager to learn you appear, the more projects and roles your future manager can envision you in. \r\n\r\nWhen interviewing, make sure to approach the situation as if there is much to be learned during that interview and your interviewer will remember you as someone they can teach, grow, and develop into a team superstar in the future.\r\n\r\n\r\n\r\n\r\n\r\nWhile you don’t want to be arrogant, you do want to show off your skills! Come prepared with one or two projects that you accomplished in your last position, or on your own! Showcase a project that has the minimum level of complexity to match the job you’re applying to. \r\n\r\nDon’t have a project you can showcase? Try building one! Study the job requirements and produce an independent project that matches in complexity. The extra level of detail, work, and effort will set you apart and give you a leg up before you even walk in the door!\r\n\r\nJoin us for Monday Night Python every Monday at PDX Code Guild and get help from other programmers and extra motivation to finish that project. Keep these tips in mind so you can achieve your dream programming position! What are some of your best technical interview tips? Leave them in the comments below!\r\n\r\n\r\n ",
        "author": "Sheri Dover",
        "created_at": "2019-09-10",
        "favorites": 56,
        "home_page": false,
        "path": "/articles/job-advice/tips-for-technical-interviews",
        "categoryPath": "/articles/job-advice/"
      }
    }
  ],
  "categories": [
    {
      "model": "article.category",
      "pk": 1,
      "fields": {
        "name": "News",
        "slug": "news"
      }
    },
    {
      "model": "article.category",
      "pk": 2,
      "fields": {
        "name": "Job Advice",
        "slug": "job-advice"
      }
    },
    {
      "model": "article.category",
      "pk": 3,
      "fields": {
        "name": "Code Guild News",
        "slug": "code-guild-news"
      }
    }
  ],
  "images": [
    {
      "model": "article.images",
      "pk": 1,
      "fields": {
        "image": "images/uploads/CodyPortland.png"
      }
    },
    {
      "model": "article.images",
      "pk": 2,
      "fields": {
        "image": "images/uploads/free_itp.png"
      }
    },
    {
      "model": "article.images",
      "pk": 4,
      "fields": {
        "image": "images/uploads/default.jpg"
      }
    },
    {
      "model": "article.images",
      "pk": 8,
      "fields": {
        "image": "images/uploads/freeprogramming_s9iMirS_GNmsJcv.png"
      }
    },
    {
      "model": "article.images",
      "pk": 9,
      "fields": {
        "image": "images/uploads/opper_is_knocking_CCrLuXh_sYLaKl9.png"
      }
    }
  ]
}